; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v4 ?v3)
             (pred_3 ?v13 ?v8)
             (pred_4 ?v4 ?v8)
             (pred_2 ?v1 ?v4 )
	     (pred_1 ?v4)
             (pred_12 ?v10)
             (pred_5 ?v13)
             (pred_10 ?v8)
             (pred_11 ?v4)
             (pred_9 ?v13)
             (pred_7 ?v4)
             (pred_6 ))



(:action op_5
:parameters (?v9 ?v7 ?v12 ?v6)
:precondition (and (pred_12 ?v9) (pred_12 ?v7) (pred_5 ?v12) (pred_10 ?v6)
          (pred_8 ?v9 ?v7) (pred_3 ?v12 ?v6)
                   (pred_4 ?v7 ?v6) (pred_1 ?v9) 
                   (pred_11 ?v7) (pred_9 ?v12))
:effect (and  (pred_7 ?v7) (not (pred_11 ?v7))))


(:action op_2
:parameters (?v9 ?v11)
:precondition (and (pred_12 ?v9) (pred_12 ?v11)
               (pred_1 ?v9) (pred_8 ?v9 ?v11) (pred_7 ?v11))
:effect (and (pred_1 ?v11) (not (pred_1 ?v9))))

(:action op_3
:parameters (?v9 ?v12)
:precondition (and (pred_12 ?v9) (pred_5 ?v12) 
                  (pred_1 ?v9) (pred_2 ?v12 ?v9) (pred_6 ))
:effect (and (pred_9 ?v12)
   (not (pred_2 ?v12 ?v9)) (not (pred_6 ))))


(:action op_1
:parameters (?v9 ?v2 ?v5)
:precondition (and (pred_12 ?v9) (pred_5 ?v2) (pred_5 ?v5)
                  (pred_1 ?v9) (pred_9 ?v5) (pred_2 ?v2 ?v9))
:effect (and (pred_9 ?v2) (pred_2 ?v5 ?v9)
        (not (pred_9 ?v5)) (not (pred_2 ?v2 ?v9))))

(:action op_4
:parameters (?v9 ?v12)
:precondition (and (pred_12 ?v9) (pred_5 ?v12) 
                  (pred_1 ?v9) (pred_9 ?v12))
:effect (and (pred_6 ) (pred_2 ?v12 ?v9) (not (pred_9 ?v12)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_03 obj_05 obj_22 obj_15 obj_13 obj_20 obj_07 obj_14 obj_09 obj_19 obj_17 obj_04 obj_11 obj_18 obj_12 obj_06
    obj_08 obj_16 obj_10
    obj_01 obj_02 obj_21
    )

    (:init
       (pred_6)

       (pred_12 obj_03)
       (pred_12 obj_05)
       (pred_12 obj_22)
       (pred_12 obj_15)
       (pred_12 obj_13)
       (pred_12 obj_20)
       (pred_12 obj_07)
       (pred_12 obj_14)
       (pred_12 obj_09)
       (pred_12 obj_19)
       (pred_12 obj_17)
       (pred_12 obj_04)
       (pred_12 obj_11)
       (pred_12 obj_18)
       (pred_12 obj_12)
       (pred_12 obj_06)
       (pred_10 obj_08)
       (pred_10 obj_16)
       (pred_10 obj_10)
       (pred_5 obj_01)
       (pred_5 obj_02)
       (pred_5 obj_21)

       (pred_8 obj_03 obj_13)
       (pred_8 obj_03 obj_05)
       (pred_8 obj_05 obj_20)
       (pred_8 obj_05 obj_22)
       (pred_8 obj_05 obj_03)
       (pred_8 obj_22 obj_07)
       (pred_8 obj_22 obj_15)
       (pred_8 obj_22 obj_05)
       (pred_8 obj_15 obj_14)
       (pred_8 obj_15 obj_22)
       (pred_8 obj_13 obj_09)
       (pred_8 obj_13 obj_20)
       (pred_8 obj_13 obj_03)
       (pred_8 obj_20 obj_19)
       (pred_8 obj_20 obj_07)
       (pred_8 obj_20 obj_05)
       (pred_8 obj_20 obj_13)
       (pred_8 obj_07 obj_17)
       (pred_8 obj_07 obj_14)
       (pred_8 obj_07 obj_22)
       (pred_8 obj_07 obj_20)
       (pred_8 obj_14 obj_04)
       (pred_8 obj_14 obj_15)
       (pred_8 obj_14 obj_07)
       (pred_8 obj_09 obj_11)
       (pred_8 obj_09 obj_19)
       (pred_8 obj_09 obj_13)
       (pred_8 obj_19 obj_18)
       (pred_8 obj_19 obj_17)
       (pred_8 obj_19 obj_20)
       (pred_8 obj_19 obj_09)
       (pred_8 obj_17 obj_12)
       (pred_8 obj_17 obj_04)
       (pred_8 obj_17 obj_07)
       (pred_8 obj_17 obj_19)
       (pred_8 obj_04 obj_06)
       (pred_8 obj_04 obj_14)
       (pred_8 obj_04 obj_17)
       (pred_8 obj_11 obj_18)
       (pred_8 obj_11 obj_09)
       (pred_8 obj_18 obj_12)
       (pred_8 obj_18 obj_19)
       (pred_8 obj_18 obj_11)
       (pred_8 obj_12 obj_06)
       (pred_8 obj_12 obj_17)
       (pred_8 obj_12 obj_18)
       (pred_8 obj_06 obj_04)
       (pred_8 obj_06 obj_12)
       (pred_11 obj_20)
       (pred_11 obj_17)
       (pred_11 obj_12)
       (pred_4  obj_20 obj_08)
       (pred_4  obj_17 obj_16)
       (pred_4  obj_12 obj_10)
       (pred_7 obj_03)
       (pred_7 obj_05)
       (pred_7 obj_22)
       (pred_7 obj_15)
       (pred_7 obj_13)
       (pred_7 obj_07)
       (pred_7 obj_14)
       (pred_7 obj_09)
       (pred_7 obj_19)
       (pred_7 obj_04)
       (pred_7 obj_11)
       (pred_7 obj_18)
       (pred_7 obj_06)

       (pred_3  obj_01 obj_08)
       (pred_3  obj_02 obj_16)
       (pred_3  obj_21 obj_10)
       (pred_2 obj_01 obj_18)
       (pred_2 obj_02 obj_13)
       (pred_2 obj_21 obj_09)
       (pred_1 obj_04)
    )

    (:goal (and
       (pred_2 obj_01 obj_04)
       (pred_2 obj_21 obj_22)
    ))
(:constraints
  (always (not (pred_1 obj_19)))
)
)

; plan
1. (op_2 obj_04 obj_14)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_14)
   goals met: 0 of 2
2. (op_2 obj_14 obj_15)
   deleted: (pred_1 obj_14)
   added: (pred_1 obj_15)
   goals met: 0 of 2
3. (op_2 obj_15 obj_22)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_22)
   goals met: 0 of 2
4. (op_2 obj_22 obj_05)
   deleted: (pred_1 obj_22)
   added: (pred_1 obj_05)
   goals met: 0 of 2
5. (op_2 obj_05 obj_03)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_03)
   goals met: 0 of 2
6. (op_2 obj_03 obj_13)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_13)
   goals met: 0 of 2
7. (op_2 obj_13 obj_09)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_09)
   goals met: 0 of 2
8. (op_3 obj_09 obj_21)
   deleted: (pred_2 obj_21 obj_09) (pred_6)
   added: (pred_9 obj_21)
   goals met: 0 of 2
9. (op_2 obj_09 obj_13)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_13)
   goals met: 0 of 2
10. (op_2 obj_13 obj_03)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_03)
   goals met: 0 of 2
11. (op_2 obj_03 obj_05)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_05)
   goals met: 0 of 2
12. (op_2 obj_05 obj_22)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_22)
   goals met: 0 of 2
13. (op_2 obj_22 obj_15)
   deleted: (pred_1 obj_22)
   added: (pred_1 obj_15)
   goals met: 0 of 2
14. (op_2 obj_15 obj_14)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_14)
   goals met: 0 of 2
15. (op_2 obj_14 obj_04)
   deleted: (pred_1 obj_14)
   added: (pred_1 obj_04)
   goals met: 0 of 2
16. (op_2 obj_04 obj_06)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_06)
   goals met: 0 of 2
17. (op_5 obj_06 obj_12 obj_21 obj_10)
   deleted: (pred_11 obj_12)
   added: (pred_7 obj_12)
   goals met: 0 of 2
18. (op_2 obj_06 obj_04)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_04)
   goals met: 0 of 2
19. (op_4 obj_04 obj_21)
   deleted: (pred_9 obj_21)
   added: (pred_6) (pred_2 obj_21 obj_04)
   goals met: 0 of 2
20. (op_2 obj_04 obj_06)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_06)
   goals met: 0 of 2
21. (op_2 obj_06 obj_12)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_12)
   goals met: 0 of 2
22. (op_2 obj_12 obj_18)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_18)
   goals met: 0 of 2
23. (op_3 obj_18 obj_01)
   deleted: (pred_2 obj_01 obj_18) (pred_6)
   added: (pred_9 obj_01)
   goals met: 0 of 2
24. (op_2 obj_18 obj_12)
   deleted: (pred_1 obj_18)
   added: (pred_1 obj_12)
   goals met: 0 of 2
25. (op_2 obj_12 obj_06)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_06)
   goals met: 0 of 2
26. (op_2 obj_06 obj_04)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_04)
   goals met: 0 of 2
27. (op_1 obj_04 obj_21 obj_01)
   deleted: (pred_9 obj_01) (pred_2 obj_21 obj_04)
   added: (pred_9 obj_21) (pred_2 obj_01 obj_04)
   goals met: 1 of 2
28. (op_2 obj_04 obj_14)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_14)
   goals met: 1 of 2
29. (op_2 obj_14 obj_15)
   deleted: (pred_1 obj_14)
   added: (pred_1 obj_15)
   goals met: 1 of 2
30. (op_2 obj_15 obj_22)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_22)
   goals met: 1 of 2
31. (op_4 obj_22 obj_21)
   deleted: (pred_9 obj_21)
   added: (pred_6) (pred_2 obj_21 obj_22)
   goals met: 2 of 2
